OdDAI.Event.makeEvent(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Creates an event with the specified function.
\param functionName [in] Pointer to a name of the function for the event.
\returns
Smart pointer to the created event.

OdDAI.Event.time
\details
Retrieves event time.
\returns
Event time as OdTimeStamp class.

OdDAI.Event.functionId
\details
Retrieves a name of the function for the event.
\returns
const char pointer to the name of the function.

OdDAI.Event.testAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the attribute value is set or is unset.
\param attrName [in] An ANSI string that contains the attribute name.
\returns Returns true if the attribute has a value; otherwise, the method returns false (it means that the attribute value is not set).

OdDAI.Event.getAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the current value of an attribute specified by its name.
\param attrName [in] An ANSI string that contains the attribute name.
\returns Returns the current value of the attribute.
\remarks
The method provides the late binding access to the attribute value by its name.
Attributes of select and aggregate data types are also supported.

OdDAI.Event.op_Assign(OdDAI.Event!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator for the Event class.
\param other            [in] Event to assign.
\returns
Reference to this modified event.
\remarks
Inaccessible.

OdDAI.Event.#ctor(OdDAI.Event!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Copy constructor for the Event class.
\param other            [in] Event to copy.
\remarks
Inaccessible.

OdDAI.Event.Dispose
\details
Destructor for the Event class.

OdDAI.Event.#ctor
\details
Default constructor for the Event class. Creates an event at the workstation date in local time.